In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df =pd.read_excel(r'C:\Users\Siddesh\Desktop\SuperStoreUS-2015.xlsx',sheet_name = "Orders")

In [4]:
df.head()

,Row ID,Order Priority,Discount,Unit Price,Shipping Cost,Customer ID,Customer Name,Ship Mode,Customer Segment,Product Category,...,Region,State or Province,City,Postal Code,Order Date,Ship Date,Profit,Quantity ordered new,Sales,Order ID
0,20847,High,0.01,2.84,0.93,3,Bonnie Potter,Express Air,Corporate,Office Supplies,...,West,Washington,Anacortes,98221,2015-01-07,2015-01-08,4.5600,4,13.01,88522
1,20228,Not Specified,0.02,500.98,26.00,5,Ronnie Proctor,Delivery Truck,Home Office,Furniture,...,West,California,San Gabriel,91776,2015-06-13,2015-06-15,4390.3665,12,6362.85,90193
2,21776,Critical,0.06,9.48,7.29,11,Marcus Dunlap,Regular Air,Home Office,Furniture,...,East,New Jersey,Roselle,7203,2015-02-15,2015-02-17,-53.8096,22,211.15,90192
3,24844,Medium,0.09,78.69,19.99,14,Gwendolyn F Tyson,Regular Air,Small Business,Furniture,...,Central,Minnesota,Prior Lake,55372,2015-05-12,2015-05-14,803.4705,16,1164.45,86838
4,24846,Medium,0.08,3.28,2.31,14,Gwendolyn F Tyson,Regular Air,Small Business,Office Supplies,...,Central,Minnesota,Prior Lake,55372,2015-05-12,2015-05-13,-24.0300,7,22.23,86838

In [5]:
df.tail()

,Row ID,Order Priority,Discount,Unit Price,Shipping Cost,Customer ID,Customer Name,Ship Mode,Customer Segment,Product Category,...,Region,State or Province,City,Postal Code,Order Date,Ship Date,Profit,Quantity ordered new,Sales,Order ID
1947,19842,High,0.01,10.90,7.46,3397,Andrea Shaw,Regular Air,Small Business,Office Supplies,...,Central,Illinois,Danville,61832,2015-03-11,2015-03-12,-116.7600,18,207.31,87536
1948,19843,High,0.10,7.99,5.03,3397,Andrea Shaw,Regular Air,Small Business,Technology,...,Central,Illinois,Danville,61832,2015-03-11,2015-03-12,-160.9520,22,143.12,87536
1949,26208,Not Specified,0.08,11.97,5.81,3399,Marvin Reid,Regular Air,Small Business,Office Supplies,...,Central,Illinois,Des Plaines,60016,2015-03-29,2015-03-31,-41.8700,5,59.98,87534
1950,24911,Medium,0.10,9.38,4.93,3400,Florence Gold,Express Air,Small Business,Furniture,...,East,West Virginia,Fairmont,26554,2015-04-04,2015-04-04,-24.7104,15,135.78,87537
1951,25914,High,0.10,105.98,13.99,3403,Tammy Buckley,Express Air,Consumer,Furniture,...,West,Wyoming,Cheyenne,82001,2015-02-08,2015-02-11,349.4850,5,506.50,87530

In [6]:
df.sample(2)

,Row ID,Order Priority,Discount,Unit Price,Shipping Cost,Customer ID,Customer Name,Ship Mode,Customer Segment,Product Category,...,Region,State or Province,City,Postal Code,Order Date,Ship Date,Profit,Quantity ordered new,Sales,Order ID
891,22682,High,0.03,2.16,6.05,1609,Jerry Ennis,Regular Air,Consumer,Office Supplies,...,West,California,Sacramento,95823,2015-05-11,2015-05-12,-90.5855,7,17.31,87824
1875,23211,High,0.03,17.48,1.99,3283,William Woodard,Regular Air,Corporate,Technology,...,South,Florida,Kendall,33156,2015-05-10,2015-05-11,710.8074,31,537.80,90753

In [7]:
df.describe()

,Row ID,Discount,Unit Price,Shipping Cost,Customer ID,Product Base Margin,Postal Code,Profit,Quantity ordered new,Sales,Order ID
count,1952.000000,1952.000000,1952.000000,1952.000000,1952.000000,1936.000000,1952.000000,1952.000000,1952.000000,1952.000000,1952.000000
mean,19916.479508,0.048975,109.079221,12.968151,1735.376537,0.515186,51534.769467,114.793859,12.944672,985.828832,82365.924180
std,5957.595627,0.031378,393.481301,17.414631,991.078006,0.137055,29362.828420,1141.112387,13.871565,2559.900167,19042.295798
min,64.000000,0.000000,1.140000,0.490000,3.000000,0.350000,1001.000000,-16476.838000,1.000000,2.250000,359.000000
25%,19121.000000,0.020000,6.480000,3.230000,875.000000,0.380000,28560.000000,-84.485400,5.000000,58.807500,86767.750000
50%,21164.500000,0.050000,20.990000,6.150000,1738.000000,0.525000,48765.500000,1.476450,10.000000,202.395000,88376.000000
75%,23483.250000,0.080000,100.972500,14.362500,2578.250000,0.590000,78550.000000,116.201575,16.000000,802.945000,89957.000000
max,26389.000000,0.210000,6783.020000,164.730000,3403.000000,0.850000,99362.000000,9228.225600,167.000000,45737.330000,91586.000000

In [8]:
#creating dataframe using dictionary

In [9]:
persons ={
 'name' : ['shiv','sam','baji','madhav'],
    'age':[50,31,39,27],
    'contribution':[1,2,3,4],
    'strategy':['preplanned','fear','speed','management']
}

In [10]:
dataframe = pd.DataFrame(persons)
dataframe.head()

     name  age  contribution    strategy
0    shiv   50             1  preplanned
1     sam   31             2        fear
2    baji   39             3       speed
3  madhav   27             4  management

In [11]:
dataframe.shape

(4, 4)

In [12]:
rows,colums = dataframe.shape

In [13]:
rows

4

In [14]:
dataframe[2:3]

   name  age  contribution strategy
2  baji   39             3    speed

In [15]:
#printing the columns
dataframe.columns

Index(['name', 'age', 'contribution', 'strategy'], dtype='object')

In [16]:
#printing single column
dataframe.name

0      shiv
1       sam
2      baji
3    madhav
Name: name, dtype: object

In [17]:
dataframe["name"]

0      shiv
1       sam
2      baji
3    madhav
Name: name, dtype: object

In [18]:
type(dataframe["name"])

pandas.core.series.Series

In [19]:
df = dataframe

In [20]:
df[['name','age']]

     name  age
0    shiv   50
1     sam   31
2    baji   39
3  madhav   27

In [21]:
df['age'].max()

50

In [22]:
df['age'].min()

27

In [23]:
df['age'].mean()

36.75

In [24]:
df['age'].std()

10.1447851956888

In [25]:
df.describe()

             age  contribution
count   4.000000      4.000000
mean   36.750000      2.500000
std    10.144785      1.290994
min    27.000000      1.000000
25%    30.000000      1.750000
50%    35.000000      2.500000
75%    41.750000      3.250000
max    50.000000      4.000000

In [26]:
df[df.age>30]

   name  age  contribution    strategy
0  shiv   50             1  preplanned
1   sam   31             2        fear
2  baji   39             3       speed

In [27]:
df[df.age == df.age.max()]

   name  age  contribution    strategy
0  shiv   50             1  preplanned

In [28]:
df[df.age == df['age'].max()]

   name  age  contribution    strategy
0  shiv   50             1  preplanned

In [29]:
df['name'][df.age == df['age'].max()]

0    shiv
Name: name, dtype: object

In [30]:
df[['name','strategy']][df.age == df['age'].max()]

   name    strategy
0  shiv  preplanned

In [31]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [35]:
df.set_index('age',inplace=True)

In [36]:
df

       name  contribution    strategy
age
50     shiv             1  preplanned
31      sam             2        fear
39     baji             3       speed
27   madhav             4  management

In [38]:
df.loc[39]

name             baji
contribution        3
strategy        speed
Name: 39, dtype: object

In [39]:
df.reset_index(inplace =True)

In [40]:
df

   age    name  contribution    strategy
0   50    shiv             1  preplanned
1   31     sam             2        fear
2   39    baji             3       speed
3   27  madhav             4  management